## Target Guided Oridinal Encoding

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    'city' : ['New York', 'London', 'Paris' , 'Tokyo', 'New York', 'Paris'],
    'price' : [200, 150, 300, 250, 180, 320]
})

df

       city  price
0  New York    200
1    London    150
2     Paris    300
3     Tokyo    250
4  New York    180
5     Paris    320

In [4]:
grouped_df = df.groupby('city')['price'].mean()

grouped_df

city
London      150.0
New York    190.0
Paris       310.0
Tokyo       250.0
Name: price, dtype: float64

In [5]:
mean_price_dict = grouped_df.to_dict()

mean_price_dict

{'London': 150.0, 'New York': 190.0, 'Paris': 310.0, 'Tokyo': 250.0}

In [6]:
df['encoded_city'] = df['city'].map(mean_price_dict)

df

       city  price  encoded_city
0  New York    200         190.0
1    London    150         150.0
2     Paris    300         310.0
3     Tokyo    250         250.0
4  New York    180         190.0
5     Paris    320         310.0

## Practice Exercise

In [7]:
import seaborn as sns

df = sns.load_dataset('tips')

df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [9]:
grouped_time = df.groupby('time')['total_bill'].mean()

mean_time_dict = grouped_time.to_dict()

df['encoded_time'] = df['time'].map(mean_time_dict)

df.head()

C:\Users\ashay\AppData\Local\Temp\ipykernel_295184\145627293.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  grouped_time = df.groupby('time')['total_bill'].mean()

   total_bill   tip     sex smoker  day    time  size encoded_time
0       16.99  1.01  Female     No  Sun  Dinner     2    20.797159
1       10.34  1.66    Male     No  Sun  Dinner     3    20.797159
2       21.01  3.50    Male     No  Sun  Dinner     3    20.797159
3       23.68  3.31    Male     No  Sun  Dinner     2    20.797159
4       24.59  3.61  Female     No  Sun  Dinner     4    20.797159